app/views/posts/index.html.erb

      <strong>By:</strong>
      <%= link_to User.find(post.user_id).name, user_path(User.find(post.user_id)) %>
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 13], ["LIMIT", 1]]