app/views/posts/show.html.erb

<strong>By:</strong>
<%= link_to User.find(@post.user_id).name, user_path(User.find(@post.user_id)) %>
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]

<ul>
  <% @post.comments.each do |comment| %>
---
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = ?  [["post_id", 10]]

      <strong>By:</strong>
      <%= link_to User.find(comment.user_id).name, user_path(User.find(comment.user_id)) %>
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 16], ["LIMIT", 1]]