app/controllers/comments_controller.rb

  def create
    @post = Post.find(params[:post_id])
    @comment = @post.comments.create(comment_params)
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 10], ["LIMIT", 1]]
INSERT INTO "comments" ("user_id", "post_id", "content", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["user_id", 11], ["post_id", 10], ["content", "dasdwww comment check 1"], ["created_at", "2023-11-05 22:31:10.476800"], ["updated_at", "2023-11-05 22:31:10.476800"]]

  def destroy
    @comment = Comment.find(params[:id])
    @post = Post.find(@comment.post_id)
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 10], ["LIMIT", 1]]