app/controllers/posts_controller.rb

SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    begin
      @post = Post.find(params[:id])

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "posts" ("user_id", "content", "title", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["user_id", 1], ["content", "sghjks"], ["title", "shuk"], ["created_at", "2023-11-05 07:48:41.397792"], ["updated_at", "2023-11-05 07:48:41.397792"]]
---
  def create
    @user = User.find(params[:user_id])
    @post = @user.posts.create(post_params)

SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
UPDATE "posts" SET "content" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["content", "dadasji"], ["updated_at", "2023-11-05 17:43:37.694963"], ["id", 3]]
---
  def update
    @post = Post.find(params[:id])
    if @post.update(post_params)

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
  def destroy
    @post = Post.find(params[:id])
    @user = User.find(@post.user_id)