app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def show
        begin
            @user = User.find(params[:id])

INSERT INTO "users" ("name", "email", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "abcd"], ["email", "abcd@gmail.com"], ["created_at", "2023-11-05 07:29:25.722640"], ["updated_at", "2023-11-05 07:29:25.722640"]]
---
    def create
        puts "Reached create method of Users"
        puts user_params
        @user = User.new(user_params)
        if @user.save

UPDATE "users" SET "email" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["email", "vihaan@ucsb.edu"], ["updated_at", "2023-11-06 00:25:41.368757"], ["id", 2]]
---
    def update
        if @user.update(user_params)

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]
DELETE FROM "users" WHERE "users"."id" = ?  [["id", 9]]
---
    def destroy
        puts "Reached destroy method"
        @user = User.find(params[:id])
        @user.destroy
        User.delete(@user)